/*
 * @Author: mangwu                                                             *
 * @File: 8.2.4.4.2 for...in .js                                               *
 * @Date: 2022-09-14 23:58:33                                                  *
 * @LastModifiedDate: 2022-09-14 23:58:50                                      *
 * @ModifiedBy: mangwu                                                         *
 * -----------------------                                                     *
 * Copyright (c) 2022 mangwu                                                   *
 * -----------------------                                                     *
 * @HISTORY:                                                                   *
 * Date   	            By 	    Comments                                       *
 * ---------------------	--------	----------------------------------------------- *
 */


// for in 获取对象上可枚举的属性，可以获取原型链上的可枚举属性